---
kind: type
id: T:Autodesk.Revit.DB.MultiReferenceAnnotation
source: html/2224ac33-d7c0-bda8-70de-0005023c2149.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotation

Multi-reference annotations are annotations pointing to more than one reference, consisting of a dimension and associated tag.

## Syntax (C#)
```csharp
public class MultiReferenceAnnotation : Element
```

## Remarks
Multi-reference annotations can be used to label and dimension Rebar elements, and are labeled in the user interface as "Multi-rebar annotations".
 MultiReferenceAnnotation is the annotation object instance. This class includes a reference to the associated dimension and tag element.